[DataObject]
checkData1=域名:#0#[#1#] 未设定内容值!
checkData2=域名:#0#[#1#] 必须填写!
checkData3=域名:#0#[#1#] 未设定长度!
checkData4=域名:#0#[#1#] 长度超过!
checkData5=域名:#0#[#1#] 型别错误!
property1=字段型态定义不符合数据对象
property2=未定义域名
property3=此字段索引未定义
property4=无此域名定义
loadFileSchema1=DataObject Schema不存在
loadSchema1=DataObjectSchema设定有误:

[DataObjectFactory]
addFieldDefinition1=DataObjectFactory 尚未初始化
addFieldDefinition2=域名#0# 重复
addIdentityField1=DataObjectFactory 尚未初始化或是fieldDefinition尚未定义
addIdentityField2=此字段: #0# 并不存在于fieldDefinition定义中
addIdentityField3=此字段: #0# 已加入identityField定义中
addKeyField1=DataObjectFactory 尚未初始化或是fieldDefinition尚未定义
addKeyField2=此字段: #0# 并不存在于fieldDefinition定义中
addKeyField3=此字段: #0# 已加入keyField定义中
addAllowEmptyField1=DataObjectFactory 尚未初始化或是fieldDefinition尚未定义
addAllowEmptyField2=此字段: #0# 并不存在于fieldDefinition定义中
addAllowEmptyField3=此字段: #0# 已加入keyField定义中
allowAllFieldEmpty1=DataObjectFactory 尚未初始化或是fieldDefinition尚未定义
addNonUpdateField1=DataObjectFactory 尚未初始化或是fieldDefinition尚未定义
addNonUpdateField2=此字段: #0# 并不存在于fieldDefinition定义中
addNonUpdateField3=此字段: #0# 已加入nonUpdateField定义中
generalXML1=DataObjectFactory 尚未初始化或是fieldDefinition尚未定义

[DataObjectSet]
checkData1=编号或关键字段重复！
loadFileSchema1=DataObject Schema不存在
reOrderField1=此字段: #0# 并不存在于fieldDefinition定义中
reOrderField2=此字段: #0# 并不存在于reOrderField定义中

[AbstractAgent]
queryDBNameLess1=DataObject Schema不存在

[DeepAgent]
queryHead1=没有指定Agent所使用的AbstractEngine对象
queryHead2=限制笔数不可小于
createEmptyDataObjectSet1=无此TableName: #0# 定义
queryCAData1=找不到此tableName
query1=没有指定Agent所使用的AbstractEngine对象
query2=限制笔数不可小于

[DoubleAgent]
createEmptyDataObjectSet1=无此TableName: #0# 定义
queryHead1=没有指定Agent所使用的AbstractEngine对象
queryHead2=限制笔数不可小于
query1=没有指定Agent所使用的AbstractEngine对象
query2=限制笔数不可小于

[MultiAgent]
createEmptyDataObjectSet1=无此TableName: #0# 定义
queryHead1=没有指定Agent所使用的AbstractEngine对象
queryHead2=限制笔数不可小于
query1=没有指定Agent所使用的AbstractEngine对象
query2=限制笔数不可小于

[NLAgent]
loadSchema1=Agent Schema不存在
queryHead1=没有指定Agent所使用的AbstractEngine对象
queryHead2=限制笔数不可小于
createEmptyDataObjectSet1=无此TableName: #0# 定义
queryCAData1=无此TableName: #0# 定义
query1=没有指定Agent所使用的AbstractEngine对象
query2=限制笔数不可小于

[SingleAgent]
query1=没有指定Agent所使用的AbstractEngine对象
query2=限制笔数不可小于

[AbstractEngine]
updateData1=数据库已有重复数据！
updateData2=处理字段[#0#]时发生错误, 错误讯息为: #1#, 此字段必须为数字型态, 目前此域值为: #2#
updateData3=数据已被其他人更新!


